---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType
source: html/e948a909-1b00-8789-6302-b46015c9cb47.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType

A StructuralConnectionHandlerType is used in StructuralConnectionHandler element generation.

## Syntax (C#)
```csharp
public class StructuralConnectionHandlerType : ElementType
```